## Name: Gokul P
## Roll No: MS21W018
### DATA WAREHOUSING AND DATA MINING
### MS9431 (EMBA) 2022
### TUTORIAL

### EXERCISE 3

Exercise 1: Generating Random Numbers (1*1 = 1 Points)
(Hint: See Readings->Software folder, Page 87 Chapter 4 of the Python Text Book uploaded)
1. Use a R/ Python code to generate random numbers between given number limits.

In [1]:
import random

random_number = random.randint(1,100)
random_number

84

Exercise 2: Working with n dimensional arrays (1*1 = 1 Points)
(Hint: See Readings->Software folder, page 88 Chapter 4 of the Python Text Book uploaded)
1. Write a R/Python code to create and print 1, 2 and 3 dimensional arrays.

In [2]:
import numpy as np
oned_array = [1,2,3,4]
twod_array = [[1,2,3,4],['india', 'australia','canada','srilanka']]
threed_array = [[[1,2,3,4],['india', 'australia','canada','srilanka']],[[5,6,7,8],['chennai', 'delhi','mumbai','bangalore']]]
x = np.array(oned_array)
y = np.array(twod_array)
z = np.array(threed_array)
print(x)
print(y)
print(z)

[1 2 3 4]
[['1' '2' '3' '4']
 ['india' 'australia' 'canada' 'srilanka']]
[[['1' '2' '3' '4']
  ['india' 'australia' 'canada' 'srilanka']]

 [['5' '6' '7' '8']
  ['chennai' 'delhi' 'mumbai' 'bangalore']]]

Exercise 3: Statistical Methods on n dimensional arrays (1*1 = 2 Points)
(Hint: See Readings->Software folder, Page 111 Chapter 4 of the Python Text Book uploaded)
1. Write a Python/R code to find the sum of the numbers in a 3-dimensional array.

In [3]:
Three_darray = [[[1,2,3,4],[5,6,7,8]],[[11,12,13,14],[15,16,17,18]],[[21,22,23,24],[25,26,27,28]],[[31,32,33,34],[35,36,37,38]]]

a = np.array(Three_darray)

In [4]:
a.sum()

624

Exercise 4: Working with DataFrame (2*1 = 2 Points)
(Hint: See Readings->Software folder, Page 129 Chapter 4 of the Python Text Book uploaded)
1. Write a Python/R code to create a dataframe.
2. Write a Python/ R code to drop a column in the dataframe created in the previous question

In [5]:
import pandas as pd
dataframe = {'Name': ['Ram', 'irfan', 'Joseph', 'suhail'], 'Age': [20, 45, 19, 32], 'country': ['india', 'pakistan', 'burma', 'afganistan'], 'city': ['chennai', 'lahore', 'Naypyidaw', 'kabul']} 
b = pd.DataFrame(dataframe)

In [6]:
print(b)

     Name  Age     country       city
0     Ram   20       india    chennai
1   irfan   45    pakistan     lahore
2  Joseph   19       burma  Naypyidaw
3  suhail   32  afganistan      kabul

In [7]:
b.drop(['city'], axis='columns', inplace=True)

In [8]:
print(b)

     Name  Age     country
0     Ram   20       india
1   irfan   45    pakistan
2  Joseph   19       burma
3  suhail   32  afganistan